DataProcessors/сабВыгрузка_Neon_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>сабВыгрузка_Neon_Настройки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид_дистрибьютора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПапкаДляВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПапкаДляРучнойВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсяНоменклатура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормироватьФайл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дистрибьютор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПочтаДляОтправкиФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПочтаДляОтправкиКопии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Почта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/сабДанныеПоставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>сабДанныеПоставок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Ответственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>Ответственные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтообновленияЗаблокированы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтообновленияЗаблокированы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНаОплатуПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/сабВыгрузка_Neon_Настройки/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроизвольныйПериодПриИзменении(Элемент)
	
	Если Объект.ПроизвольныйПериод Тогда
		Элементы.ДатаНачала.Доступность = Истина;
		Элементы.ДатаОкончания.Доступность = Истина;
	Иначе
		Элементы.ДатаНачала.Доступность = Ложь;
		Элементы.ДатаОкончания.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда		
		ТекстСообщения = НСтр(
		"ru='Для данной операции необходимо
		|установить расширение работы с файлами!
		|Установка выполняется в разделе
		|""Сервис и администрирование""/
		|""Настройка сервисных функций"".'"
		);
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.Каталог = ПутьКФайлу;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок = НСтр("ru = 'Выберите каталог'");
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлы(Команда) 
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеОтветаСохранитьНастройки",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Настройки были изменены. Перед выгрузкой необходимо сохранить настройки. Сохранить настройки и продолжить?",РежимДиалогаВопрос.ДаНетОтмена);
	Иначе	
		ВыгрузитьФайлыНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОтветаСохранитьНастройки(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиНаСервере();
		Модифицированность = Ложь;
		ВыгрузитьФайлыНаКлиенте();	
	КонецЕсли;
	
КонецПроцедуры  


&НаКлиенте
Процедура ВыгрузитьФайлыНаКлиенте()
	
	Если Объект.ПроизвольныйПериод Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			Сообщить("Период должен быть заполнен.");
			Возврат;
		КонецЕсли;
		Если НачалоДня(Объект.ДатаНачала) > НачалоДня(Объект.ДатаОкончания) Тогда
			Сообщить("Дата окончания не может быть меньше даты начала");
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	Для Каждого СтрокаКонтрагенты Из Объект.Контрагенты Цикл
		Если Не ЗначениеЗаполнено(СокрЛП(СтрокаКонтрагенты.ПапкаДляРучнойВыгрузки)) Тогда
			Продолжить;
		КонецЕсли;
		
		Пакет = Новый ПакетОтображаемыхДокументов; 
		ЛистГлавная = Новый ТабличныйДокумент;
		ЛистДвиженияПоСкладу = Новый ТабличныйДокумент;
		ЛистОстаткиПоСкладу = Новый ТабличныйДокумент; 
		ДатаНачалаДляНаименованияФайла = "";
		ДатаОкончанияДляНаименованияФайла = "";
		СтруктураСтрокаКонтрагенты = Новый Структура("Поставщик,ВсяНоменклатура,ИД,Организация,Почта",СтрокаКонтрагенты.Поставщик,СтрокаКонтрагенты.ВсяНоменклатура,СтрокаКонтрагенты.ИД,СтрокаКонтрагенты.Дистрибьютор,СтрокаКонтрагенты.Почта);
		
		ЗаполнитьТабличныеДокументы(ЛистГлавная,ЛистДвиженияПоСкладу,ЛистОстаткиПоСкладу,СтруктураСтрокаКонтрагенты,ДатаНачалаДляНаименованияФайла,ДатаОкончанияДляНаименованияФайла);
		ЭлементПакета = Пакет.Состав.Добавить();
		ЭлементПакета.Наименование = "Главная";
		ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(ЛистГлавная);
		
		ЭлементПакета = Пакет.Состав.Добавить();
		ЭлементПакета.Наименование = "товар - движение по складу";
		ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(ЛистДвиженияПоСкладу);  
		
		ЭлементПакета = Пакет.Состав.Добавить();
		ЭлементПакета.Наименование = "товар - остатки товара";
		ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(ЛистОстаткиПоСкладу);
		
		Попытка
			ИмяФайла = СтрокаКонтрагенты.ПапкаДляРучнойВыгрузки + "\" + СтрокаКонтрагенты.НаименованиеФайла + " " + 
			ДатаНачалаДляНаименованияФайла + "-" + ДатаОкончанияДляНаименованияФайла + ".XLSX";
			Пакет.Записать(ИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
			Сообщить("Файл выгружен в " + ИмяФайла);
		Исключение
			Сообщить("Ошибка выгрузки " + ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;	
		
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТабличныеДокументы(ЛистГлавная,ЛистДвиженияПоСкладу,ЛистОстаткиПоСкладу,СтрокаКонтрагенты,ДатаНачалаДляНаименованияФайла,ДатаОкончанияДляНаименованияФайла)
	
	Если СтрокаКонтрагенты.ВсяНоменклатура Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("Контрагент", СтрокаКонтрагенты.Поставщик);
		РезультатЗапроса = Запрос.Выполнить();
		НоменклатураДляОтбора = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	Иначе
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)";
		Запрос.УстановитьПараметр("Ссылка",Объект.Номенклатура.Выгрузить(Новый Структура("Контрагент,Выгружать",
		СтрокаКонтрагенты.Поставщик,Истина),"Номенклатура").ВыгрузитьКолонку("Номенклатура"));
		РезультатЗапроса = Запрос.Выполнить();
		НоменклатураДляОтбора = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	ДатаНачалаВыгрузки = ?(Объект.ПроизвольныйПериод, НачалоДня(Объект.ДатаНачала), НачалоДня(ТекущаяДата() - 1728000)); 
	ДатаОкончанияВыгрузки = ?(Объект.ПроизвольныйПериод, КонецДня(Объект.ДатаОкончания), КонецДня(ТекущаяДата()));
    ДатаНачалаДляНаименованияФайла = Строка(Формат(ДатаНачалаВыгрузки,"ДФ=ddMMyyyy")); 
	ДатаОкончанияДляНаименованияФайла = Строка(Формат(ДатаОкончанияВыгрузки,"ДФ=ddMMyyyy")); 
	Обработка =  РеквизитФормыВЗначение("Объект");
	
	//Файл ДвиженияПоСкладу 
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	сабДанныеПоставокСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(сабДанныеПоставокСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТЦеныСоСкладами
	|ИЗ
	|	РегистрСведений.сабДанныеПоставок.СрезПоследних(, Номенклатура В (&Номенклатура) И Предприятие.ОсновнаяОрганизация = &Организация) КАК сабДанныеПоставокСрезПоследних
	|		
	|СГРУППИРОВАТЬ ПО
	|	сабДанныеПоставокСрезПоследних.Номенклатура
	|;
	|		
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦеныСоСкладами.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(сабДанныеПоставокСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТЦены
	|ИЗ
	|	ВТЦеныСоСкладами КАК ВТЦеныСоСкладами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сабДанныеПоставок.СрезПоследних(, Номенклатура В (&Номенклатура) И Предприятие.ОсновнаяОрганизация = &Организация) КАК сабДанныеПоставокСрезПоследних
	|		ПО (ВТЦеныСоСкладами.Номенклатура = сабДанныеПоставокСрезПоследних.Номенклатура)
	|					И (ВТЦеныСоСкладами.Период = сабДанныеПоставокСрезПоследних.Период)
	|СГРУППИРОВАТЬ ПО
	|	ВТЦеныСоСкладами.Номенклатура
	|
	|;
	|		
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК НоменклатураШтрихкод
	|ПОМЕСТИТЬ ВТШтрихкоды
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод <> """"
	|	И ШтрихкодыНоменклатуры.Номенклатура В(&Номенклатура)
	
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыНоменклатуры.Номенклатура
	
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураШтрихкод
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаОперации,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаДокумента,
	|	0 КАК ТипПеремещения,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент.Наименование КАК НаименованиКлиента,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент.Код КАК КодКлиента,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Ссылка.Контрагент.Код
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Грузополучатель.Код
	|	КОНЕЦ КАК КодАдреса,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент.ИНН КАК ИННКлиента,
	|	РеализацияТоваровУслугТовары.Ссылка.Склад.Код КАК НомерСклада,
	|	РеализацияТоваровУслугТовары.Ссылка.АдресДоставки КАК АдресКлиента,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер КАК НомерДокумента1,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Ссылка.Контрагент.КПП
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Грузополучатель.КПП
	|	КОНЕЦ КАК НомерДокумента3,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК КодТП,
	|	РеализацияТоваровУслугТовары.Номенклатура.Наименование КАК НаименованиеТП,
	|	РеализацияТоваровУслугТовары.Количество КАК КоличествоТовара,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|					ТОГДА РеализацияТоваровУслугТовары.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|			КОНЕЦ / РеализацияТоваровУслугТовары.Количество
	|	КОНЕЦ КАК ЦенаРеализации,
	|	РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента.Представление КАК ВалютаОперации,
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Ссылка.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Грузополучатель
	|	КОНЕЦ КАК ПодразделениеКонтрагента,
	|	РеализацияТоваровУслугТовары.Ссылка.Склад КАК Склад,
	|	РеализацияТоваровУслугТовары.Ссылка.Склад.Наименование КАК СкладНаименование,
	|	РеализацияТоваровУслугТовары.Ссылка.Склад.АдресСкладаДляВыгрузки КАК СкладАдресСкладаДляВыгрузки,
	|	РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента.Наименование КАК ВалютаДокументаНаименование,
	|	РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименованиеПолное,
	|	РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация
	|ПОМЕСТИТЬ ВТПродажи
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РеализацияТоваровУслугТовары.Ссылка.Проведен
	|	И РеализацияТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	РозничнаяПродажаТовары.Ссылка.Дата,
	|	РозничнаяПродажаТовары.Ссылка.Дата,
	|	0,
	|	""[Частное лицо]"",
	|	"""",
	|	"""",
	|	"""",
	|	РозничнаяПродажаТовары.Ссылка.Склад.Код,
	|	""[Частное лицо]"",
	|	РозничнаяПродажаТовары.Ссылка.Номер,
	|	"""",
	|	РозничнаяПродажаТовары.Номенклатура.Код,
	|	РозничнаяПродажаТовары.Номенклатура.Наименование,
	|	РозничнаяПродажаТовары.Количество,
	|	ВЫБОР
	|		КОГДА РозничнаяПродажаТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РозничнаяПродажаТовары.Ссылка.СуммаВключаетНДС
	|					ТОГДА РозничнаяПродажаТовары.Сумма
	|				ИНАЧЕ РозничнаяПродажаТовары.Сумма + РозничнаяПродажаТовары.СуммаНДС
	|			КОНЕЦ / РозничнаяПродажаТовары.Количество
	|	КОНЕЦ,
	|	РозничнаяПродажаТовары.Ссылка.ВалютаДокумента.Представление,
	|	РозничнаяПродажаТовары.Ссылка,
	|	РозничнаяПродажаТовары.Номенклатура,
	|	"""",
	|	РозничнаяПродажаТовары.Ссылка.СуммаВключаетНДС,
	|	"""",
	|	РозничнаяПродажаТовары.Ссылка.Склад,
	|	РозничнаяПродажаТовары.Ссылка.Склад.Наименование,
	|	РозничнаяПродажаТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	РозничнаяПродажаТовары.Ссылка.ВалютаДокумента.Код,
	|	РозничнаяПродажаТовары.Ссылка.ВалютаДокумента.Наименование,
	|	РозничнаяПродажаТовары.Ссылка.ВалютаДокумента.НаименованиеПолное,
	|	РозничнаяПродажаТовары.Ссылка.Организация
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК РозничнаяПродажаТовары
	|ГДЕ
	|	РозничнаяПродажаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РозничнаяПродажаТовары.Ссылка.Проведен
	|	И РозничнаяПродажаТовары.Номенклатура В(&Номенклатура) 
	|	И РозничнаяПродажаТовары.Ссылка.Организация = &Организация
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	|	1,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент.Наименование,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент.Код,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Ссылка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслугТовары.Ссылка.Контрагент.Код
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Ссылка.Грузоотправитель.Код
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент.ИНН,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Склад.Код,
	|	"""",
	|	ПоступлениеТоваровУслугТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Ссылка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслугТовары.Ссылка.Контрагент.КПП
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Ссылка.Грузоотправитель.КПП
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Код,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Наименование,
	|	ПоступлениеТоваровУслугТовары.Количество,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|					ТОГДА ПоступлениеТоваровУслугТовары.Сумма
	|				ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС
	|			КОНЕЦ / ПоступлениеТоваровУслугТовары.Количество
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента.Представление,
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент,
	|	ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Ссылка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслугТовары.Ссылка.Контрагент
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Ссылка.Грузоотправитель
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Склад,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Склад.Наименование,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента.Код,
	|	ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента.Наименование,
	|	ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента.НаименованиеПолное,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Организация
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|	И ПоступлениеТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Организация = &Организация
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата,
	|	2,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.Наименование,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.Код,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.Код,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.ИНН,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Склад.Код,
	|	"""",
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
	|	"""",
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Наименование,
	|	ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателяТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	|					ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма
	|				ИНАЧЕ ВозвратТоваровОтПокупателяТовары.Сумма + ВозвратТоваровОтПокупателяТовары.СуммаНДС
	|			КОНЕЦ / ВозвратТоваровОтПокупателяТовары.Количество
	|	КОНЕЦ,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента.Представление,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Склад,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Склад.Наименование,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента.Код,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента.Наименование,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента.НаименованиеПолное,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Организация
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|ГДЕ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен
	|	И ВозвратТоваровОтПокупателяТовары.Номенклатура В(&Номенклатура)  
	|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Организация = &Организация
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	СписаниеТоваровТовары.Ссылка.Дата,
	|	СписаниеТоваровТовары.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА СписаниеТоваровТовары.Ссылка.ИнвентаризацияТоваровНаСкладе = ЗНАЧЕНИЕ(Документ.ИнвентаризацияТоваровНаСкладе.ПустаяСсылка)
	|			ТОГДА 3
	|		ИНАЧЕ 8
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	СписаниеТоваровТовары.Ссылка.Склад.Код,
	|	"""",
	|	СписаниеТоваровТовары.Ссылка.Номер,
	|	"""",
	|	СписаниеТоваровТовары.Номенклатура.Код,
	|	СписаниеТоваровТовары.Номенклатура.Наименование,
	|	СписаниеТоваровТовары.Количество,
	|	0,
	|	"""",
	|	СписаниеТоваровТовары.Ссылка,
	|	СписаниеТоваровТовары.Номенклатура,
	|	"""",
	|	"""",
	|	"""",
	|	СписаниеТоваровТовары.Ссылка.Склад,
	|	СписаниеТоваровТовары.Ссылка.Склад.Наименование,
	|	СписаниеТоваровТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	"""",
	|	"""",
	|	"""",
	|	СписаниеТоваровТовары.Ссылка.Организация
	|ИЗ
	|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	|ГДЕ
	|	СписаниеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеТоваров.СписаниеСоСклада)
	|	И СписаниеТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И СписаниеТоваровТовары.Ссылка.Проведен
	|	И СписаниеТоваровТовары.Номенклатура В(&Номенклатура)
	|	И СписаниеТоваровТовары.Ссылка.Организация = &Организация
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ТребованиеНакладнаяМатериалы.Ссылка.Дата,
	|	ТребованиеНакладнаяМатериалы.Ссылка.Дата,
	|	3,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ТребованиеНакладнаяМатериалы.Ссылка.Склад.Код,
	|	"""",
	|	ТребованиеНакладнаяМатериалы.Ссылка.Номер,
	|	"""",
	|	ТребованиеНакладнаяМатериалы.Номенклатура.Код,
	|	ТребованиеНакладнаяМатериалы.Номенклатура.Наименование,
	|	ТребованиеНакладнаяМатериалы.Количество,
	|	0,
	|	"""",
	|	ТребованиеНакладнаяМатериалы.Ссылка,
	|	ТребованиеНакладнаяМатериалы.Номенклатура,
	|	"""",
	|	"""",
	|	"""",
	|	ТребованиеНакладнаяМатериалы.Ссылка.Склад,
	|	ТребованиеНакладнаяМатериалы.Ссылка.Склад.Наименование,
	|	ТребованиеНакладнаяМатериалы.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	"""",
	|	"""",
	|	"""",
	|	ТребованиеНакладнаяМатериалы.Ссылка.Организация
	|ИЗ
	|	Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
	|ГДЕ
	|	ТребованиеНакладнаяМатериалы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТребованиеНакладнаяМатериалы.Ссылка.Проведен
	|	И ТребованиеНакладнаяМатериалы.Номенклатура В(&Номенклатура)
	|	И ТребованиеНакладнаяМатериалы.Ссылка.Организация = &Организация
    |	И ТребованиеНакладнаяМатериалы.Счет = &Счет4101
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Дата,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Дата,
	|	4,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент.Наименование,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент.Код,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент.Код
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.Грузополучатель.Код
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент.ИНН,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад.Код,
	|	"""",
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент.КПП
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.Грузополучатель.КПП
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Код,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Наименование,
	|	ВозвратТоваровПоставщикуТовары.Количество,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.СуммаВключаетНДС
	|					ТОГДА ВозвратТоваровПоставщикуТовары.Сумма
	|				ИНАЧЕ ВозвратТоваровПоставщикуТовары.Сумма + ВозвратТоваровПоставщикуТовары.СуммаНДС
	|			КОНЕЦ / ВозвратТоваровПоставщикуТовары.Количество
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ВалютаДокумента.Представление,
	|	ВозвратТоваровПоставщикуТовары.Ссылка,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.Грузополучатель
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад.Наименование,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ВалютаДокумента.Код,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ВалютаДокумента.Наименование,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ВалютаДокумента.НаименованиеПолное,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Организация
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВозвратТоваровПоставщикуТовары.Ссылка.Проведен
	|	И ВозвратТоваровПоставщикуТовары.Номенклатура В(&Номенклатура)
	|	И ВозвратТоваровПоставщикуТовары.Ссылка.Организация = &Организация
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ОприходованиеТоваровТовары.Ссылка.Дата,
	|	ОприходованиеТоваровТовары.Ссылка.Дата,
	|	7,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ОприходованиеТоваровТовары.Ссылка.Склад.Код,
	|	"""",
	|	ОприходованиеТоваровТовары.Ссылка.Номер,
	|	"""",
	|	ОприходованиеТоваровТовары.Номенклатура.Код,
	|	ОприходованиеТоваровТовары.Номенклатура.Наименование,
	|	ОприходованиеТоваровТовары.Количество,
	|	ОприходованиеТоваровТовары.Цена,
	|	"""",
	|	ОприходованиеТоваровТовары.Ссылка,
	|	ОприходованиеТоваровТовары.Номенклатура,
	|	"""",
	|	"""",
	|	"""",
	|	ОприходованиеТоваровТовары.Ссылка.Склад,
	|	ОприходованиеТоваровТовары.Ссылка.Склад.Наименование,
	|	ОприходованиеТоваровТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	"""",
	|	"""",
	|	"""",
	|	ОприходованиеТоваровТовары.Ссылка.Организация
	|ИЗ
	|	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
	|ГДЕ
	|	ОприходованиеТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОприходованиеТоваровТовары.Ссылка.Проведен
	|	И ОприходованиеТоваровТовары.Номенклатура В(&Номенклатура)
	|	И ОприходованиеТоваровТовары.Ссылка.Организация = &Организация
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	5,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.Код,
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.Номер,
	|	"""",
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
	|	ПеремещениеТоваровТовары.Количество,
	|	0,
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	"""",
	|	"""",
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.Наименование,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.АдресСкладаДляВыгрузки,
	|	"""",
	|	"""",
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.Организация
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПеремещениеТоваровТовары.Ссылка.Проведен
	|	И ПеремещениеТоваровТовары.Номенклатура В(&Номенклатура) 
	|	И ПеремещениеТоваровТовары.Ссылка.Организация = &Организация
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	6,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.Код,
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.Номер,
	|	"""",
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
	|	ПеремещениеТоваровТовары.Количество,
	|	0,
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	"""",
	|	"""",
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.Наименование,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.АдресСкладаДляВыгрузки,
	|	"""",
	|	"""",
	|	"""",
	|	ПеремещениеТоваровТовары.Ссылка.Организация
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПеремещениеТоваровТовары.Ссылка.Проведен
	|	И ПеремещениеТоваровТовары.Номенклатура В(&Номенклатура)
	|	И ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеТоваров.ПередачаМеждуСкладами)
	|	И ПеремещениеТоваровТовары.Ссылка.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка.Дата,
	|	КорректировкаРеализацииТовары.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения > 0
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.Ссылка.Контрагент.Наименование,
	|	КорректировкаРеализацииТовары.Ссылка.Контрагент.Код,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаРеализацииТовары.Ссылка.Контрагент.Код
	|		ИНАЧЕ КорректировкаРеализацииТовары.Ссылка.Грузополучатель.Код
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.Ссылка.Контрагент.ИНН,
	|	КорректировкаРеализацииТовары.Ссылка.Склад.Код,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения > 0
	|			ТОГДА КорректировкаРеализацииТовары.Ссылка.АдресДоставки
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения > 0
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА КорректировкаРеализацииТовары.Ссылка.Контрагент.КПП
	|					ИНАЧЕ КорректировкаРеализацииТовары.Ссылка.Грузополучатель.КПП
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.Номенклатура.Код,
	|	КорректировкаРеализацииТовары.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Количество > КорректировкаРеализацииТовары.КоличествоДоИзменения
	|			ТОГДА КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения
	|		ИНАЧЕ -1 * (КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения = 0
	|			ТОГДА 0
	|		КОГДА КорректировкаРеализацииТовары.Количество > КорректировкаРеализацииТовары.КоличествоДоИзменения
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
	|						ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения
	|					ИНАЧЕ КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения + (КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения)
	|				КОНЕЦ / (КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
	|					ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма
	|				ИНАЧЕ КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма + (КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС)
	|			КОНЕЦ / (КорректировкаРеализацииТовары.КоличествоДоИзменения - КорректировкаРеализацииТовары.Количество)
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.Ссылка.ВалютаДокумента.Представление,
	|	КорректировкаРеализацииТовары.Ссылка,
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.Ссылка.Контрагент,
	|	КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаРеализацииТовары.Ссылка.Контрагент
	|		ИНАЧЕ КорректировкаРеализацииТовары.Ссылка.Грузополучатель
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.Ссылка.Склад,
	|	КорректировкаРеализацииТовары.Ссылка.Склад.Наименование,
	|	КорректировкаРеализацииТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	КорректировкаРеализацииТовары.Ссылка.ВалютаДокумента.Код,
	|	КорректировкаРеализацииТовары.Ссылка.ВалютаДокумента.Наименование,
	|	КорректировкаРеализацииТовары.Ссылка.ВалютаДокумента.НаименованиеПолное,
	|	КорректировкаРеализацииТовары.Ссылка.Организация
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения <> 0
	|	И КорректировкаРеализацииТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И КорректировкаРеализацииТовары.Ссылка.Проведен
	|	И КорректировкаРеализацииТовары.Номенклатура В(&Номенклатура)
	|	И КорректировкаРеализацииТовары.Ссылка.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияТовары.Ссылка.Дата,
	|	КорректировкаПоступленияТовары.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения > 0
	|			ТОГДА 1
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	КорректировкаПоступленияТовары.Ссылка.Контрагент.Наименование,
	|	КорректировкаПоступленияТовары.Ссылка.Контрагент.Код,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияТовары.Ссылка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаПоступленияТовары.Ссылка.Контрагент.Код
	|		ИНАЧЕ КорректировкаПоступленияТовары.Ссылка.Грузоотправитель.Код
	|	КОНЕЦ,
	|	КорректировкаПоступленияТовары.Ссылка.Контрагент.ИНН,
	|	КорректировкаПоступленияТовары.Ссылка.Склад.Код,
	|	"""",
	|	КорректировкаПоступленияТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияТовары.Ссылка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаПоступленияТовары.Ссылка.Контрагент.КПП
	|		ИНАЧЕ КорректировкаПоступленияТовары.Ссылка.Грузоотправитель.КПП
	|	КОНЕЦ,
	|	КорректировкаПоступленияТовары.Номенклатура.Код,
	|	КорректировкаПоступленияТовары.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияТовары.Количество > КорректировкаПоступленияТовары.КоличествоДоИзменения
	|			ТОГДА КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения
	|		ИНАЧЕ -1 * (КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения = 0
	|			ТОГДА 0
	|		КОГДА КорректировкаПоступленияТовары.Количество > КорректировкаПоступленияТовары.КоличествоДоИзменения
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС
	|						ТОГДА КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения
	|					ИНАЧЕ КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения + (КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения)
	|				КОНЕЦ / (КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС
	|					ТОГДА КорректировкаПоступленияТовары.СуммаДоИзменения - КорректировкаПоступленияТовары.Сумма
	|				ИНАЧЕ КорректировкаПоступленияТовары.СуммаДоИзменения - КорректировкаПоступленияТовары.Сумма + (КорректировкаПоступленияТовары.СуммаНДСДоИзменения - КорректировкаПоступленияТовары.СуммаНДС)
	|			КОНЕЦ / (КорректировкаПоступленияТовары.КоличествоДоИзменения - КорректировкаПоступленияТовары.Количество)
	|	КОНЕЦ,
	|	КорректировкаПоступленияТовары.Ссылка.ВалютаДокумента.Представление,
	|	КорректировкаПоступленияТовары.Ссылка,
	|	КорректировкаПоступленияТовары.Номенклатура,
	|	КорректировкаПоступленияТовары.Ссылка.Контрагент,
	|	КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияТовары.Ссылка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаПоступленияТовары.Ссылка.Контрагент
	|		ИНАЧЕ КорректировкаПоступленияТовары.Ссылка.Грузоотправитель
	|	КОНЕЦ,
	|	КорректировкаПоступленияТовары.Ссылка.Склад,
	|	КорректировкаПоступленияТовары.Ссылка.Склад.Наименование,
	|	КорректировкаПоступленияТовары.Ссылка.Склад.АдресСкладаДляВыгрузки,
	|	КорректировкаПоступленияТовары.Ссылка.ВалютаДокумента.Код,
	|	КорректировкаПоступленияТовары.Ссылка.ВалютаДокумента.Наименование,
	|	КорректировкаПоступленияТовары.Ссылка.ВалютаДокумента.НаименованиеПолное,
	|	КорректировкаПоступленияТовары.Ссылка.Организация
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|ГДЕ
	|	КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения <> 0
	|	И КорректировкаПоступленияТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И КорректировкаПоступленияТовары.Ссылка.Проведен
	|	И КорректировкаПоступленияТовары.Номенклатура В(&Номенклатура)
	|	И КорректировкаПоступленияТовары.Ссылка.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТАдреса
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТПродажи.Контрагент КАК Контрагент
	|			ИЗ
	|				ВТПродажи КАК ВТПродажи
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				ВТПродажи.ПодразделениеКонтрагента
	|			ИЗ
	|				ВТПродажи КАК ВТПродажи)
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТАдреса.Представление) КАК Представление,
	|	ВТАдреса.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТАдресаСгрупп
	|ИЗ
	|	ВТАдреса КАК ВТАдреса
	
	|СГРУППИРОВАТЬ ПО
	|	ВТАдреса.Ссылка
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПродажи.Ссылка КАК Ссылка1,
	|	ВТПродажи.ДатаОперации КАК ДатаОперации,
	|	ВТПродажи.ДатаДокумента КАК ДатаДокумента,
	|	ВТПродажи.ТипПеремещения КАК ТипПеремещения,
	|	ВТПродажи.НаименованиКлиента КАК НаименованиеКлиента, 
	|	ВЫБОР 
	|		КОГДА СокрЛП(ВТПродажи.КодКлиента) = """" 
	|			ТОГДА ВТПродажи.КодКлиента
	|   	ИНАЧЕ ""["" + ВТПродажи.КодКлиента + ""]"" 
	|	КОНЕЦ КАК КодКлиента, 
	|	ВЫБОР 
	|		КОГДА СокрЛП(ВТПродажи.КодАдреса) = """" 
	|			ТОГДА ВТПродажи.КодАдреса
	|   	ИНАЧЕ ""["" + ВТПродажи.КодАдреса + ""]"" 
	|	КОНЕЦ КАК КодАдреса,  
	|	ВЫБОР 
	|		КОГДА СокрЛП(ВТПродажи.ИННКлиента) = """" 
	|			ТОГДА ВТПродажи.ИННКлиента
	|   	ИНАЧЕ ""["" + ВТПродажи.ИННКлиента + ""]"" 
	|	КОНЕЦ КАК ИННКлиента,
	|	ВЫБОР 
	|		КОГДА СокрЛП(ВТПродажи.НомерСклада) = """" 
	|			ТОГДА ВТПродажи.НомерСклада
	|   	ИНАЧЕ ""["" + ВТПродажи.НомерСклада + ""]"" 
	|	КОНЕЦ КАК НомерСклада,
	|	ВЫБОР
	|		КОГДА ДлинаСтроки(СОКРЛП(ВТПродажи.АдресКлиента)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА СОКРЛП(ЕСТЬNULL(ВТАдресаСгрупп.Представление, """")) = """"
	|						ТОГДА ВТАдресаСгрупп1.Представление
	|					ИНАЧЕ ЕСТЬNULL(ВТАдресаСгрупп.Представление, """")
	|				КОНЕЦ
	|		ИНАЧЕ ВТПродажи.АдресКлиента
	|	КОНЕЦ КАК АдресКлиента,
	|	ВТПродажи.НомерДокумента1 КАК НомерДокумента1,
	|	ВТПродажи.НомерДокумента3 КАК НомерДокумента3,
	|	ВЫБОР 
	|		КОГДА СокрЛП(ВТПродажи.КодТП) = """" 
	|			ТОГДА ВТПродажи.КодТП
	|   	ИНАЧЕ ""["" + ВТПродажи.КодТП + ""]"" 
	|	КОНЕЦ КАК КодТП, 
	|	ВТПродажи.НаименованиеТП КАК НаименованиеТП,
	|	ВТПродажи.КоличествоТовара КАК КоличествоТовара,
	|	ВЫБОР
	|		КОГДА ВТПродажи.ТипПеремещения = 0
	|			ТОГДА ВТПродажи.ЦенаРеализации
	|		КОГДА ВТПродажи.ТипПеремещения = 1
	|			ТОГДА """"
	|		КОГДА ВТПродажи.ТипПеремещения = 2
	|			ТОГДА ВТПродажи.ЦенаРеализации
	|		КОГДА ВТПродажи.ТипПеремещения = 3
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 4
	|			ТОГДА ВТПродажи.ЦенаРеализации
	|		КОГДА ВТПродажи.ТипПеремещения = 5
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 6
	|			ТОГДА """"
	|		КОГДА ВТПродажи.ТипПеремещения = 7
	|			ТОГДА """"
	|		КОГДА ВТПродажи.ТипПеремещения = 8
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|	КОНЕЦ КАК ЦенаРеализации,
	|	ВТПродажи.Ссылка КАК Ссылка,
	|	ВТПродажи.Номенклатура КАК Номенклатура,
	|	ВТПродажи.Контрагент КАК Контрагент,
	|	ВТПродажи.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТПродажи.ПодразделениеКонтрагента КАК ПодразделениеКонтрагента,
	|	ВТПродажи.Склад КАК Склад,
	|	ВТПродажи.СкладНаименование КАК СкладНаименование,
	|	ВТПродажи.СкладАдресСкладаДляВыгрузки КАК СкладАдресСкладаДляВыгрузки,
	|	ВТПродажи.ВалютаДокументаКод КАК ВалютаДокументаКод,
	|	ВЫБОР
	|		КОГДА ВТПродажи.ВалютаДокументаКод = ""643"" ИЛИ ВТПродажи.ВалютаДокументаКод = """"
	|			ТОГДА ""RUR""
	|		ИНАЧЕ ВТПродажи.ВалютаДокументаНаименование
	|	КОНЕЦ КАК ВалютаОперации,
	|	ВЫБОР 
	|		КОГДА СокрЛП(ЕСТЬNULL(ВТШтрихкоды.Штрихкод, """")) = """" 
	|			ТОГДА ЕСТЬNULL(ВТШтрихкоды.Штрихкод, """")
	|   	ИНАЧЕ ""["" + ЕСТЬNULL(ВТШтрихкоды.Штрихкод, """") + ""]"" 
	|	КОНЕЦ КАК ШтрихкодТП, 
	|	ВЫБОР
	|		КОГДА ВТПродажи.ТипПеремещения = 0
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 1
	|			ТОГДА ВТПродажи.ЦенаРеализации
	|		КОГДА ВТПродажи.ТипПеремещения = 2
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 3
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 4
	|			ТОГДА ВТПродажи.ЦенаРеализации
	|		КОГДА ВТПродажи.ТипПеремещения = 5
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 6
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 7
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|		КОГДА ВТПродажи.ТипПеремещения = 8
	|			ТОГДА ЕСТЬNULL(ВТЦены.Цена, """")
	|	КОНЕЦ КАК ЦенаПоставки,
	|	ЕСТЬNULL(ОтветственныеСрезПоследних.Ответственный.ФИО, """") КАК ТорговыйПредставитель,
	|	ВЫБОР 
	|		КОГДА СокрЛП(ЕСТЬNULL(ОтветственныеСрезПоследних.Ответственный.Код, """")) = """" 
	|			ТОГДА ЕСТЬNULL(ОтветственныеСрезПоследних.Ответственный.Код, """")
	|   	ИНАЧЕ ""["" + ЕСТЬNULL(ОтветственныеСрезПоследних.Ответственный.Код, """") + ""]"" 
	|	КОНЕЦ КАК КодТорговогоПредставителя
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	|		ПО (ВТЦены.Номенклатура = ВТПродажи.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтрихкоды КАК ВТШтрихкоды
	|		ПО (ВТШтрихкоды.НоменклатураШтрихкод = ВТПродажи.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресаСгрупп КАК ВТАдресаСгрупп
	|		ПО (ВЫБОР
	|				КОГДА ВТПродажи.ПодразделениеКонтрагента = """"
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ВТПродажи.ПодразделениеКонтрагента = ВТАдресаСгрупп.Ссылка
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресаСгрупп КАК ВТАдресаСгрупп1
	|		ПО (ВЫБОР
	|				КОГДА ВТПродажи.Контрагент = """"
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ВТПродажи.Контрагент = ВТАдресаСгрупп1.Ссылка
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ответственные.СрезПоследних(
	|				,
	|				Контрагент В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Продажи.Контрагент
	|					ИЗ
	|						ВТПродажи КАК Продажи)) КАК ОтветственныеСрезПоследних
	|		ПО (ВТПродажи.Контрагент = ОтветственныеСрезПоследних.Контрагент)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачалаВыгрузки);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончанияВыгрузки);
	Запрос.УстановитьПараметр("Номенклатура",НоменклатураДляОтбора); 
	Запрос.УстановитьПараметр("Организация",СтрокаКонтрагенты.Организация);
	Запрос.УстановитьПараметр("Счет4101",ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
	РезультатЗапроса = Запрос.Выполнить();
	Макет = Обработка.ПолучитьМакет("ДвиженияПоСкладу");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ЛистДвиженияПоСкладу.Вывести(ОбластьЗаголовок);
	ВыборкаДвиженияПоСкладам = РезультатЗапроса.Выбрать();
	НомерЗаписи = 0;
	Пока ВыборкаДвиженияПоСкладам.Следующий() Цикл 
		НомерЗаписи = НомерЗаписи + 1;
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры.Заполнить(ВыборкаДвиженияПоСкладам);
		ОбластьДанные.Параметры.НомерСтроки = НомерЗаписи;
		Если Не ЗначениеЗаполнено(ВыборкаДвиженияПоСкладам.ЦенаРеализации) Тогда
			ОбластьДанные.Параметры.ЦенаРеализации = 0;	
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(ВыборкаДвиженияПоСкладам.ЦенаПоставки) Тогда
			ОбластьДанные.Параметры.ЦенаПоставки = 0;	
		КонецЕсли;
		ЛистДвиженияПоСкладу.Вывести(ОбластьДанные); 
	КонецЦикла; 
	
	//Файл ОстаткиПоСкладу
	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст = "ВЫБРАТЬ
	|	сабДанныеПоставокСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(сабДанныеПоставокСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТЦеныСоСкладами
	|ИЗ
	|	РегистрСведений.сабДанныеПоставок.СрезПоследних(
	|			,
	|			Номенклатура В (&Номенклатура)
	|				И Предприятие.ОсновнаяОрганизация = &Организация) КАК сабДанныеПоставокСрезПоследних
	
	|СГРУППИРОВАТЬ ПО
	|	сабДанныеПоставокСрезПоследних.Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦеныСоСкладами.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(сабДанныеПоставокСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТЦены
	|ИЗ
	|	ВТЦеныСоСкладами КАК ВТЦеныСоСкладами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сабДанныеПоставок.СрезПоследних(
	|				,
	|				Номенклатура В (&Номенклатура)
	|					И Предприятие.ОсновнаяОрганизация = &Организация) КАК сабДанныеПоставокСрезПоследних
	|		ПО (ВТЦеныСоСкладами.Номенклатура = сабДанныеПоставокСрезПоследних.Номенклатура)
	|			И (ВТЦеныСоСкладами.Период = сабДанныеПоставокСрезПоследних.Период)
	
	|СГРУППИРОВАТЬ ПО
	|	ВТЦеныСоСкладами.Номенклатура
	
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК НоменклатураШтрихкод
	|ПОМЕСТИТЬ ВТШтрихкоды
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод <> """"
	|	И ШтрихкодыНоменклатуры.Номенклатура В(&Номенклатура)
	
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыНоменклатуры.Номенклатура
	
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураШтрихкод
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА СокрЛП(ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Номенклатура).Код) = """" 
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Номенклатура).Код
	|   	ИНАЧЕ ""["" + ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Номенклатура).Код + ""]"" 
	|	КОНЕЦ КАК КодТП, 
    |	ВЫБОР 
	|		КОГДА СокрЛП(ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.Склады).Код) = """" 
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.Склады).Код
	|   	ИНАЧЕ ""["" + ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.Склады).Код + ""]"" 
	|	КОНЕЦ КАК НомерСклада,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.Склады).Наименование КАК СкладНаименование,
	|   ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Номенклатура).Наименование КАК НаименованиеТП, 
	|	ХозрасчетныйОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоНачальныйОстаток * ЕСТЬNULL(ВТЦены.Цена, 0) КАК СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток * ЕСТЬNULL(ВТЦены.Цена, 0) КАК СуммаКонечныйОстаток,
	|	ВЫБОР 
	|		КОГДА СокрЛП(ЕСТЬNULL(ВТШтрихкоды.Штрихкод, """")) = """" 
	|			ТОГДА ЕСТЬNULL(ВТШтрихкоды.Штрихкод, """")
	|   	ИНАЧЕ ""["" + ЕСТЬNULL(ВТШтрихкоды.Штрихкод, """") + ""]"" 
	|	КОНЕЦ КАК ШтрихкодТП  
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, , , Счет = &Счет, &МассивСубконто, Организация = &Организация И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Номенклатура) В (&Номенклатура)) КАК ХозрасчетныйОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	|		ПО ((ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Номенклатура)) = ВТЦены.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтрихкоды КАК ВТШтрихкоды
	|		ПО ((ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Номенклатура)) = ВТШтрихкоды.НоменклатураШтрихкод)";

	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	ЗапросОстатки.УстановитьПараметр("ДатаНачала",ДатаНачалаВыгрузки);
	ЗапросОстатки.УстановитьПараметр("ДатаОкончания",ДатаОкончанияВыгрузки);
	ЗапросОстатки.УстановитьПараметр("МассивСубконто",МассивСубконто);
	ЗапросОстатки.УстановитьПараметр("Номенклатура",НоменклатураДляОтбора);
	ЗапросОстатки.УстановитьПараметр("Организация",СтрокаКонтрагенты.Организация);
	ЗапросОстатки.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.ТоварыНаСкладах); 
	РезультатЗапросаОстатки = ЗапросОстатки.Выполнить();	
	ВыборкаОстатки = РезультатЗапросаОстатки.Выбрать();	
	Макет = Обработка.ПолучитьМакет("ОстаткиПоСкладу");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ЛистОстаткиПоСкладу.Вывести(ОбластьЗаголовок);
	
	Пока ВыборкаОстатки.Следующий() Цикл
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры.Заполнить(ВыборкаОстатки);
		ЛистОстаткиПоСкладу.Вывести(ОбластьДанные);
	КонецЦикла;
	
	//Файл главная
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ИНН КАК ИНН,
	|	&Дистрибьютор КАК Дистрибьютор,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания,
	|	&Почта КАК Почта,
	|	ЗапросДвиженияПоСкладам.НомерСклада КАК НомерСклада,
	|	ЗапросДвиженияПоСкладам.СкладНаименование КАК НаименованиеСклада
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	&ЗапросДвиженияПоСкладам КАК ЗапросДвиженияПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ИНН КАК ИНН,
	|	&Дистрибьютор КАК Дистрибьютор,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания,
	|	&Почта КАК Почта,
	|	ЗапросОстаткиПоСкладам.НомерСклада КАК НомерСклада,
	|	ЗапросОстаткиПоСкладам.СкладНаименование КАК НаименованиеСклада
	|ПОМЕСТИТЬ ВТСкладыОстатки
	|ИЗ
	|	&ЗапросОстаткиПоСкладам КАК ЗапросОстаткиПоСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСклады.ИНН КАК ИНН,
	|	ВТСклады.Дистрибьютор КАК Дистрибьютор,
	|	ВТСклады.ДатаНачала КАК ДатаНачала,
	|	ВТСклады.ДатаОкончания КАК ДатаОкончания,
	|	ВТСклады.Почта КАК Почта,
	|	ВТСклады.НомерСклада КАК НомерСклада,
	|	ВТСклады.НаименованиеСклада КАК НазваниеСклада
	|ИЗ
	|	ВТСклады КАК ВТСклады
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТСкладыОстатки.ИНН,
	|	ВТСкладыОстатки.Дистрибьютор,
	|	ВТСкладыОстатки.ДатаНачала,
	|	ВТСкладыОстатки.ДатаОкончания,
	|	ВТСкладыОстатки.Почта,
	|	ВТСкладыОстатки.НомерСклада,
	|	ВТСкладыОстатки.НаименованиеСклада
	|ИЗ
	|	ВТСкладыОстатки КАК ВТСкладыОстатки";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаВыгрузки);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияВыгрузки);
	Запрос.УстановитьПараметр("Дистрибьютор", СтрокаКонтрагенты.Организация);
	Запрос.УстановитьПараметр("ИНН", СтрокаКонтрагенты.Организация.ИНН);
	Запрос.УстановитьПараметр("ЗапросДвиженияПоСкладам", РезультатЗапроса);
	Запрос.УстановитьПараметр("ЗапросОстаткиПоСкладам", РезультатЗапросаОстатки);
    Запрос.УстановитьПараметр("Почта", СтрокаКонтрагенты.Почта);

	РезультатЗапросаГлавная = Запрос.Выполнить();
	
	ВыборкаГдавная = РезультатЗапросаГлавная.Выбрать();
	Макет = Обработка.ПолучитьМакет("Главная");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ЛистГлавная.Вывести(ОбластьЗаголовок);

	Пока ВыборкаГдавная.Следующий() Цикл
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры.Заполнить(ВыборкаГдавная);
		ЛистГлавная.Вывести(ОбластьДанные);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройка = РеквизитФормыВЗначение("Объект").ИзвлечьНастройкуИзХранилища();
	Если ЗначениеЗаполнено(Настройка) тогда
		Объект.Контрагенты.Очистить();
		Объект.Контрагенты.Загрузить(Настройка.Контрагенты);
		Объект.Номенклатура.Очистить();
		Объект.Номенклатура.Загрузить(Настройка.Номенклатура);
	КонецЕсли;
	Если Объект.ПроизвольныйПериод Тогда
		Элементы.ДатаНачала.Доступность = Истина;
		Элементы.ДатаОкончания.Доступность = Истина;
	Иначе
		Элементы.ДатаНачала.Доступность = Ложь;
		Элементы.ДатаОкончания.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РежимВыгрузкиКонтрагентов = "" Тогда
		РежимВыгрузкиКонтрагентов = "Активные";	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗНоменклатура.Контрагент КАК Контрагент,
	|	ТЗНоменклатура.Номенклатура КАК Номенклатура,
	|	ТЗНоменклатура.Выгружать КАК Выгружать
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	&ТЗНоменклатура КАК ТЗНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНоменклатура.Контрагент КАК Контрагент,
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Выгружать КАК Выгружать
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|ГДЕ
	|	ВТНоменклатура.Контрагент В (&Контрагенты)";
	
	Запрос.УстановитьПараметр("ТЗНоменклатура", Объект.Номенклатура.Выгрузить());
	Запрос.УстановитьПараметр("Контрагенты", Объект.Контрагенты.Выгрузить().ВыгрузитьКолонку("Поставщик"));
	РезультатЗапроса = Запрос.Выполнить();
	Настройка = Новый Структура("Контрагенты, Номенклатура", 
	Объект.Контрагенты.Выгрузить(),РезультатЗапроса.Выгрузить());
	РеквизитФормыВЗначение("Объект").ПоместитьНастройкуВХранилище(Настройка);
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	Модифицированность = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентыПапкаДляВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда		
		ТекстСообщения = НСтр(
		"ru='Для данной операции необходимо
		|установить расширение работы с файлами!
		|Установка выполняется в разделе
		|""Сервис и администрирование""/
		|""Настройка сервисных функций"".'"
		);
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.Каталог = Элементы.Контрагенты.ТекущиеДанные.ПапкаДляВыгрузки;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок = НСтр("ru = 'Выберите каталог'");
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Элементы.Контрагенты.ТекущиеДанные.ПапкаДляВыгрузки = ДиалогВыбораКаталога.Каталог;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Контрагенты.ТекущиеДанные <> Неопределено Тогда
		МассивСтрок = Объект.Номенклатура.НайтиСтроки(Новый Структура("Контрагент", Элементы.Контрагенты.ТекущиеДанные.Поставщик)); 
		Если МассивСтрок.Количество() > 0 Тогда
			Элементы.Номенклатура.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПоставщикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Элементы.Контрагенты.ТекущиеДанные.Поставщик Тогда
		ЗаполнитьНоменклатуруПоПоставщикуНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНоменклатуруПоПоставщикуНаСервере(Поставщик)
	
	МассивСтрок = Объект.Номенклатура.НайтиСтроки(Новый Структура("Контрагент",Поставщик));
	Если МассивСтрок.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("Контрагент", Поставщик);
		РезультатЗапроса = Запрос.Выполнить(); 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаНоменклатура = Объект.Номенклатура.Добавить();
			НоваяСтрокаНоменклатура.Номенклатура = Выборка.Номенклатура;
			НоваяСтрокаНоменклатура.Контрагент = Выборка.Контрагент;
			НоваяСтрокаНоменклатура.Выгружать = Истина;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Модифицированность = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда 
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеОтветаЗакрытиеФормы",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Настройки были изменены.Сохранить настройки?",РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОтветаЗакрытиеФормы(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиНаСервере();
		Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПапкаДляРучнойВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда		
		ТекстСообщения = НСтр(
		"ru='Для данной операции необходимо
		|установить расширение работы с файлами!
		|Установка выполняется в разделе
		|""Сервис и администрирование""/
		|""Настройка сервисных функций"".'"
		);
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.Каталог = Элементы.Контрагенты.ТекущиеДанные.ПапкаДляРучнойВыгрузки;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок = НСтр("ru = 'Выберите каталог'");
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Элементы.Контрагенты.ТекущиеДанные.ПапкаДляРучнойВыгрузки = ДиалогВыбораКаталога.Каталог;
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Контрагент = Элементы.Контрагенты.ТекущиеДанные.Поставщик;
		Элемент.ТекущиеДанные.Выгружать = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Контрагенты.ТекущиеДанные.ВсяНоменклатура Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Для добавления номенклатуры необходимо снять признак ""Вся номенклатура"" для контрагента");
	КонецЕсли;
	
КонецПроцедуры
